Revit 2027 API
ExportUtils.GetGBXMLDocumentId Method
 Retrieves the GUID representing this document in exported gbXML files.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static Guid GetGBXMLDocumentId(
	Document document
)
Public Shared Function GetGBXMLDocumentId (
	document As Document
) As Guid
public:
static Guid GetGBXMLDocumentId(
	Document^ document
)
static member GetGBXMLDocumentId :
        document : Document -> Guid
Parameters
document Document
 The document.
Return Value
Guid
 The value of the GUID representing this document in gbXML export.
Exceptions
Exception | Condition
ArgumentNullException |  A non-optional argument was null
Remarks
 This id can be used to cross-reference different gbXML exports from the same document.
See Also
Reference
ExportUtils Class
Autodesk.Revit.DB Namespace